G-JE/Tsunami/WaveBee/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTC1 (coord B11), J1[5]/U20[C5]/I2S_TXD
  @{ */
#define BOARD_INITPINS_I2S_TXD_PERIPHERAL I2S0               /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_TXD_SIGNAL TXD0                   /*!<@brief I2S0 signal: TXD0 */
#define BOARD_INITPINS_I2S_TXD_PORT PORTC                    /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2S_TXD_PIN 1U                        /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_I2S_TXD_PIN_NAME I2S0_TXD0            /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_TXD_LABEL "J1[5]/U20[C5]/I2S_TXD" /*!<@brief Label */
#define BOARD_INITPINS_I2S_TXD_NAME "I2S_TXD"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name PORTC6 (coord C8), J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK
  @{ */
#define BOARD_INITPINS_I2S_MCLK_PERIPHERAL I2S0                         /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_MCLK_SIGNAL MCLK                             /*!<@brief I2S0 signal: MCLK */
#define BOARD_INITPINS_I2S_MCLK_PORT PORTC                              /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2S_MCLK_PIN 6U                                  /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_I2S_MCLK_PIN_NAME I2S0_MCLK                      /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_MCLK_LABEL "J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK" /*!<@brief Label */
#define BOARD_INITPINS_I2S_MCLK_NAME "I2S_MCLK"                         /*!<@brief Identifier name */
                                                                        /* @} */

/*! @name PORTC10 (coord C7), J2[20]/U20[D8]/I2C1_SCL/DA7212_CLK
  @{ */
#define BOARD_INITPINS_I2C1_SCL_PERIPHERAL I2C1                            /*!<@brief Device name: I2C1 */
#define BOARD_INITPINS_I2C1_SCL_SIGNAL SCL                                 /*!<@brief I2C1 signal: SCL */
#define BOARD_INITPINS_I2C1_SCL_PORT PORTC                                 /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2C1_SCL_PIN 10U                                    /*!<@brief PORTC pin index: 10 */
#define BOARD_INITPINS_I2C1_SCL_PIN_NAME I2C1_SCL                          /*!<@brief Pin name */
#define BOARD_INITPINS_I2C1_SCL_LABEL "J2[20]/U20[D8]/I2C1_SCL/DA7212_CLK" /*!<@brief Label */
#define BOARD_INITPINS_I2C1_SCL_NAME "I2C1_SCL"                            /*!<@brief Identifier name */
                                                                           /* @} */

/*! @name PORTC11 (coord B7), J2[18]/U20[C9]/I2C1_SDA/DA7212_SDA
  @{ */
#define BOARD_INITPINS_I2C1_SDA_PERIPHERAL I2C1                            /*!<@brief Device name: I2C1 */
#define BOARD_INITPINS_I2C1_SDA_SIGNAL SDA                                 /*!<@brief I2C1 signal: SDA */
#define BOARD_INITPINS_I2C1_SDA_PORT PORTC                                 /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_I2C1_SDA_PIN 11U                                    /*!<@brief PORTC pin index: 11 */
#define BOARD_INITPINS_I2C1_SDA_PIN_NAME I2C1_SDA                          /*!<@brief Pin name */
#define BOARD_INITPINS_I2C1_SDA_LABEL "J2[18]/U20[C9]/I2C1_SDA/DA7212_SDA" /*!<@brief Label */
#define BOARD_INITPINS_I2C1_SDA_NAME "I2C1_SDA"                            /*!<@brief Identifier name */
                                                                           /* @} */

/*! @name PORTE12 (coord G3), J1[1]/J37[3]/I2S_TX_BCLK
  @{ */
#define BOARD_INITPINS_I2S_TX_BCLK_PERIPHERAL I2S0                  /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_TX_BCLK_SIGNAL TX_BCLK                   /*!<@brief I2S0 signal: TX_BCLK */
#define BOARD_INITPINS_I2S_TX_BCLK_PORT PORTE                       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_I2S_TX_BCLK_PIN 12U                          /*!<@brief PORTE pin index: 12 */
#define BOARD_INITPINS_I2S_TX_BCLK_PIN_NAME I2S0_TX_BCLK            /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_TX_BCLK_LABEL "J1[1]/J37[3]/I2S_TX_BCLK" /*!<@brief Label */
#define BOARD_INITPINS_I2S_TX_BCLK_NAME "I2S_TX_BCLK"               /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name PORTE11 (coord G4), J1[3]/J38[3]/I2S_TX_WCLK
  @{ */
#define BOARD_INITPINS_I2S_TX_WCLK_PERIPHERAL I2S0                  /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_TX_WCLK_SIGNAL TX_FS                     /*!<@brief I2S0 signal: TX_FS */
#define BOARD_INITPINS_I2S_TX_WCLK_PORT PORTE                       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_I2S_TX_WCLK_PIN 11U                          /*!<@brief PORTE pin index: 11 */
#define BOARD_INITPINS_I2S_TX_WCLK_PIN_NAME I2S0_TX_FS              /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_TX_WCLK_LABEL "J1[3]/J38[3]/I2S_TX_WCLK" /*!<@brief Label */
#define BOARD_INITPINS_I2S_TX_WCLK_NAME "I2S_TX_WCLK"               /*!<@brief Identifier name */
                                                                    /* @} */

