G-JE/Tsunami/WaveBee/board/pin_mux.h
/*! @name PORTB16 (coord E10), U7[4]/UART0_RX
  @{ */
#define BOARD_INITPINS_DEBUG_UART_RX_PERIPHERAL UART0       /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_DEBUG_UART_RX_SIGNAL RX              /*!<@brief UART0 signal: RX */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT PORTB             /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 16U                /*!<@brief PORTB pin index: 16 */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN_NAME UART0_RX      /*!<@brief Pin name */
#define BOARD_INITPINS_DEBUG_UART_RX_LABEL "U7[4]/UART0_RX" /*!<@brief Label */
#define BOARD_INITPINS_DEBUG_UART_RX_NAME "DEBUG_UART_RX"   /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTB17 (coord E9), U10[1]/UART0_TX
  @{ */
#define BOARD_INITPINS_DEBUG_UART_TX_PERIPHERAL UART0        /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_DEBUG_UART_TX_SIGNAL TX               /*!<@brief UART0 signal: TX */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT PORTB              /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 17U                 /*!<@brief PORTB pin index: 17 */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN_NAME UART0_TX       /*!<@brief Pin name */
#define BOARD_INITPINS_DEBUG_UART_TX_LABEL "U10[1]/UART0_TX" /*!<@brief Label */
#define BOARD_INITPINS_DEBUG_UART_TX_NAME "DEBUG_UART_TX"    /*!<@brief Identifier name */
                                                             /* @} */

/*! @name PORTE7 (coord F4), J1[15]/J34[1]/U20[C7]/I2S_RXD0
  @{ */
#define BOARD_INITPINS_I2S_RXD0_PERIPHERAL I2S0                        /*!<@brief Device name: I2S0 */
#define BOARD_INITPINS_I2S_RXD0_SIGNAL RXD0                            /*!<@brief I2S0 signal: RXD0 */
#define BOARD_INITPINS_I2S_RXD0_PORT PORTE                             /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_I2S_RXD0_PIN 7U                                 /*!<@brief PORTE pin index: 7 */
#define BOARD_INITPINS_I2S_RXD0_PIN_NAME I2S0_RXD0                     /*!<@brief Pin name */
#define BOARD_INITPINS_I2S_RXD0_LABEL "J1[15]/J34[1]/U20[C7]/I2S_RXD0" /*!<@brief Label */
#define BOARD_INITPINS_I2S_RXD0_NAME "I2S_RXD0"                        /*!<@brief Identifier name */
                                                                       /* @} */

/*! @name PORTE0 (coord D3), SDHC0_D1
  @{ */
#define BOARD_INITPINS_SDHC0_D1_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_D1_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SDHC0_D1_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_D1_PIN 0U            /*!<@brief PORTE pin index: 0 */
#define BOARD_INITPINS_SDHC0_D1_CHANNEL 1         /*!<@brief SDHC DATA channel: 1 */
#define BOARD_INITPINS_SDHC0_D1_PIN_NAME SDHC0_D1 /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_D1_LABEL "SDHC0_D1"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_D1_NAME "SDHC0_D1"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTE1 (coord D2), SDHC0_D0
  @{ */
#define BOARD_INITPINS_SDHC0_D0_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_D0_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SDHC0_D0_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_D0_PIN 1U            /*!<@brief PORTE pin index: 1 */
#define BOARD_INITPINS_SDHC0_D0_CHANNEL 0         /*!<@brief SDHC DATA channel: 0 */
#define BOARD_INITPINS_SDHC0_D0_PIN_NAME SDHC0_D0 /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_D0_LABEL "SDHC0_D0"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_D0_NAME "SDHC0_D0"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTE2 (coord D1), SDHC0_DCLK
  @{ */
#define BOARD_INITPINS_SDHC0_DCLK_PERIPHERAL SDHC     /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_DCLK_SIGNAL DCLK         /*!<@brief SDHC signal: DCLK */
#define BOARD_INITPINS_SDHC0_DCLK_PORT PORTE          /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_DCLK_PIN 2U              /*!<@brief PORTE pin index: 2 */
#define BOARD_INITPINS_SDHC0_DCLK_PIN_NAME SDHC0_DCLK /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_DCLK_LABEL "SDHC0_DCLK"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_DCLK_NAME "SDHC0_DCLK"   /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE3 (coord E4), SDHC0_CMD
  @{ */
#define BOARD_INITPINS_SDHC0_CMD_PERIPHERAL SDHC    /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_CMD_SIGNAL CMD         /*!<@brief SDHC signal: CMD */
#define BOARD_INITPINS_SDHC0_CMD_PORT PORTE         /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_CMD_PIN 3U             /*!<@brief PORTE pin index: 3 */
#define BOARD_INITPINS_SDHC0_CMD_PIN_NAME SDHC0_CMD /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_CMD_LABEL "SDHC0_CMD"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_CMD_NAME "SDHC0_CMD"   /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTE4 (coord E3), SDHC0_D3
  @{ */
#define BOARD_INITPINS_SDHC0_D3_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_D3_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SDHC0_D3_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_D3_PIN 4U            /*!<@brief PORTE pin index: 4 */
#define BOARD_INITPINS_SDHC0_D3_CHANNEL 3         /*!<@brief SDHC DATA channel: 3 */
#define BOARD_INITPINS_SDHC0_D3_PIN_NAME SDHC0_D3 /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_D3_LABEL "SDHC0_D3"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_D3_NAME "SDHC0_D3"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTE5 (coord E2), SDHC0_D2
  @{ */
#define BOARD_INITPINS_SDHC0_D2_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_INITPINS_SDHC0_D2_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_INITPINS_SDHC0_D2_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_SDHC0_D2_PIN 5U            /*!<@brief PORTE pin index: 5 */
#define BOARD_INITPINS_SDHC0_D2_CHANNEL 2         /*!<@brief SDHC DATA channel: 2 */
#define BOARD_INITPINS_SDHC0_D2_PIN_NAME SDHC0_D2 /*!<@brief Pin name */
#define BOARD_INITPINS_SDHC0_D2_LABEL "SDHC0_D2"  /*!<@brief Label */
#define BOARD_INITPINS_SDHC0_D2_NAME "SDHC0_D2"   /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTD10 (coord B3), SD_CARD_DETECT
  @{ */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_PERIPHERAL GPIOD             /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_SIGNAL GPIO                  /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_GPIO GPIOD                   /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_GPIO_PIN 10U                 /*!<@brief PORTD pin index: 10 */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_PORT PORTD                   /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_PIN 10U                      /*!<@brief PORTD pin index: 10 */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_CHANNEL 10                   /*!<@brief GPIOD GPIO channel: 10 */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_PIN_NAME PTD10               /*!<@brief Pin name */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_LABEL "SD_CARD_DETECT"       /*!<@brief Label */
#define BOARD_INITPINS_SDCARD_CARD_DETECTION_NAME "SDCARD_CARD_DETECTION" /*!<@brief Identifier name */
                                                                          /* @} */

/*! @name PORTB2 (coord G12), J4[12]/ADC0_SE12/I2C0_SCL
  @{ */
#define BOARD_INITPINS_ADC0_SE12_PERIPHERAL ADC0                   /*!<@brief Device name: ADC0 */
#define BOARD_INITPINS_ADC0_SE12_SIGNAL SE                         /*!<@brief ADC0 signal: SE */
#define BOARD_INITPINS_ADC0_SE12_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC0_SE12_PIN 2U                            /*!<@brief PORTB pin index: 2 */
#define BOARD_INITPINS_ADC0_SE12_CHANNEL 12                        /*!<@brief ADC0 SE channel: 12 */
#define BOARD_INITPINS_ADC0_SE12_PIN_NAME ADC0_SE12                /*!<@brief Pin name */
#define BOARD_INITPINS_ADC0_SE12_LABEL "J4[12]/ADC0_SE12/I2C0_SCL" /*!<@brief Label */
#define BOARD_INITPINS_ADC0_SE12_NAME "ADC0_SE12"                  /*!<@brief Identifier name */
                                                                   /* @} */

