G-JE/Tsunami/WaveBee/board/pin_mux.h
/*! @name PORTB3 (coord G11), J4[10]/ADC0_SE13/I2C0_SDA
  @{ */
#define BOARD_INITPINS_ADC0_SE13_PERIPHERAL ADC0                   /*!<@brief Device name: ADC0 */
#define BOARD_INITPINS_ADC0_SE13_SIGNAL SE                         /*!<@brief ADC0 signal: SE */
#define BOARD_INITPINS_ADC0_SE13_PORT PORTB                        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC0_SE13_PIN 3U                            /*!<@brief PORTB pin index: 3 */
#define BOARD_INITPINS_ADC0_SE13_CHANNEL 13                        /*!<@brief ADC0 SE channel: 13 */
#define BOARD_INITPINS_ADC0_SE13_PIN_NAME ADC0_SE13                /*!<@brief Pin name */
#define BOARD_INITPINS_ADC0_SE13_LABEL "J4[10]/ADC0_SE13/I2C0_SDA" /*!<@brief Label */
#define BOARD_INITPINS_ADC0_SE13_NAME "ADC0_SE13"                  /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name PORTB4 (coord G10), J4[8]/ADC1_SE10
  @{ */
#define BOARD_INITPINS_ADC1_SE10_PERIPHERAL ADC1         /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_ADC1_SE10_SIGNAL SE               /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_ADC1_SE10_PORT PORTB              /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC1_SE10_PIN 4U                  /*!<@brief PORTB pin index: 4 */
#define BOARD_INITPINS_ADC1_SE10_CHANNEL 10              /*!<@brief ADC1 SE channel: 10 */
#define BOARD_INITPINS_ADC1_SE10_PIN_NAME ADC1_SE10      /*!<@brief Pin name */
#define BOARD_INITPINS_ADC1_SE10_LABEL "J4[8]/ADC1_SE10" /*!<@brief Label */
#define BOARD_INITPINS_ADC1_SE10_NAME "ADC1_SE10"        /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTB5 (coord G9), J4[6]/ADC1_SE11
  @{ */
#define BOARD_INITPINS_ADC1_SE11_PERIPHERAL ADC1         /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_ADC1_SE11_SIGNAL SE               /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_ADC1_SE11_PORT PORTB              /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC1_SE11_PIN 5U                  /*!<@brief PORTB pin index: 5 */
#define BOARD_INITPINS_ADC1_SE11_CHANNEL 11              /*!<@brief ADC1 SE channel: 11 */
#define BOARD_INITPINS_ADC1_SE11_PIN_NAME ADC1_SE11      /*!<@brief Pin name */
#define BOARD_INITPINS_ADC1_SE11_LABEL "J4[6]/ADC1_SE11" /*!<@brief Label */
#define BOARD_INITPINS_ADC1_SE11_NAME "ADC1_SE11"        /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTB6 (coord F12), J4[4]/ADC1_SE12
  @{ */
#define BOARD_INITPINS_ADC1_SE12_PERIPHERAL ADC1         /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_ADC1_SE12_SIGNAL SE               /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_ADC1_SE12_PORT PORTB              /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC1_SE12_PIN 6U                  /*!<@brief PORTB pin index: 6 */
#define BOARD_INITPINS_ADC1_SE12_CHANNEL 12              /*!<@brief ADC1 SE channel: 12 */
#define BOARD_INITPINS_ADC1_SE12_PIN_NAME ADC1_SE12      /*!<@brief Pin name */
#define BOARD_INITPINS_ADC1_SE12_LABEL "J4[4]/ADC1_SE12" /*!<@brief Label */
#define BOARD_INITPINS_ADC1_SE12_NAME "ADC1_SE12"        /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTB7 (coord F11), J4[2]/ADC1_SE13
  @{ */
#define BOARD_INITPINS_ADC1_SE13_PERIPHERAL ADC1         /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_ADC1_SE13_SIGNAL SE               /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_ADC1_SE13_PORT PORTB              /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_ADC1_SE13_PIN 7U                  /*!<@brief PORTB pin index: 7 */
#define BOARD_INITPINS_ADC1_SE13_CHANNEL 13              /*!<@brief ADC1 SE channel: 13 */
#define BOARD_INITPINS_ADC1_SE13_PIN_NAME ADC1_SE13      /*!<@brief Pin name */
#define BOARD_INITPINS_ADC1_SE13_LABEL "J4[2]/ADC1_SE13" /*!<@brief Label */
#define BOARD_INITPINS_ADC1_SE13_NAME "ADC1_SE13"        /*!<@brief Identifier name */
                                                         /* @} */

/*! @name PORTB10 (coord E12), J2[7]/PTB10_RC/ADC1_SE14
  @{ */
#define BOARD_INITPINS_PTB10_RC_PERIPHERAL ADC1                  /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_PTB10_RC_SIGNAL SE                        /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_PTB10_RC_PORT PORTB                       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_PTB10_RC_PIN 10U                          /*!<@brief PORTB pin index: 10 */
#define BOARD_INITPINS_PTB10_RC_CHANNEL 14                       /*!<@brief ADC1 SE channel: 14 */
#define BOARD_INITPINS_PTB10_RC_PIN_NAME ADC1_SE14               /*!<@brief Pin name */
#define BOARD_INITPINS_PTB10_RC_LABEL "J2[7]/PTB10_RC/ADC1_SE14" /*!<@brief Label */
#define BOARD_INITPINS_PTB10_RC_NAME "PTB10_RC"                  /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name PORTB11 (coord E11), J2[9]/PTB11_RC/ADC1_SE15
  @{ */
#define BOARD_INITPINS_PTB11_RC_PERIPHERAL ADC1                  /*!<@brief Device name: ADC1 */
#define BOARD_INITPINS_PTB11_RC_SIGNAL SE                        /*!<@brief ADC1 signal: SE */
#define BOARD_INITPINS_PTB11_RC_PORT PORTB                       /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_PTB11_RC_PIN 11U                          /*!<@brief PORTB pin index: 11 */
#define BOARD_INITPINS_PTB11_RC_CHANNEL 15                       /*!<@brief ADC1 SE channel: 15 */
#define BOARD_INITPINS_PTB11_RC_PIN_NAME ADC1_SE15               /*!<@brief Pin name */
#define BOARD_INITPINS_PTB11_RC_LABEL "J2[9]/PTB11_RC/ADC1_SE15" /*!<@brief Label */
#define BOARD_INITPINS_PTB11_RC_NAME "PTB11_RC"                  /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name PORTD12 (coord B1), row1
  @{ */
#define BOARD_INITPINS_FB_A20_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_FB_A20_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_FB_A20_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_FB_A20_GPIO_PIN 12U     /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_FB_A20_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_FB_A20_PIN 12U          /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_FB_A20_CHANNEL 12       /*!<@brief GPIOD GPIO channel: 12 */
#define BOARD_INITPINS_FB_A20_PIN_NAME PTD12   /*!<@brief Pin name */
#define BOARD_INITPINS_FB_A20_LABEL "row1"     /*!<@brief Label */
#define BOARD_INITPINS_FB_A20_NAME "FB_A20"    /*!<@brief Identifier name */
                                               /* @} */

