G-JE/Tsunami/WaveBee/board/pin_mux.h
/*! @name PORTD13 (coord C3), row2
  @{ */
#define BOARD_INITPINS_FB_A21_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_FB_A21_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_FB_A21_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_FB_A21_GPIO_PIN 13U     /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_FB_A21_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_FB_A21_PIN 13U          /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_FB_A21_CHANNEL 13       /*!<@brief GPIOD GPIO channel: 13 */
#define BOARD_INITPINS_FB_A21_PIN_NAME PTD13   /*!<@brief Pin name */
#define BOARD_INITPINS_FB_A21_LABEL "row2"     /*!<@brief Label */
#define BOARD_INITPINS_FB_A21_NAME "FB_A21"    /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE25 (coord K5), row3
  @{ */
#define BOARD_INITPINS_ADC0_SE18_PERIPHERAL GPIOE /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_ADC0_SE18_SIGNAL GPIO      /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_ADC0_SE18_GPIO GPIOE       /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_ADC0_SE18_GPIO_PIN 25U     /*!<@brief PORTE pin index: 25 */
#define BOARD_INITPINS_ADC0_SE18_PORT PORTE       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_ADC0_SE18_PIN 25U          /*!<@brief PORTE pin index: 25 */
#define BOARD_INITPINS_ADC0_SE18_CHANNEL 25       /*!<@brief GPIOE GPIO channel: 25 */
#define BOARD_INITPINS_ADC0_SE18_PIN_NAME PTE25   /*!<@brief Pin name */
#define BOARD_INITPINS_ADC0_SE18_LABEL "row3"     /*!<@brief Label */
#define BOARD_INITPINS_ADC0_SE18_NAME "ADC0_SE18" /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTE24 (coord M4), row4
  @{ */
#define BOARD_INITPINS_ADC0_SE17_PERIPHERAL GPIOE /*!<@brief Device name: GPIOE */
#define BOARD_INITPINS_ADC0_SE17_SIGNAL GPIO      /*!<@brief GPIOE signal: GPIO */
#define BOARD_INITPINS_ADC0_SE17_GPIO GPIOE       /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_ADC0_SE17_GPIO_PIN 24U     /*!<@brief PORTE pin index: 24 */
#define BOARD_INITPINS_ADC0_SE17_PORT PORTE       /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_ADC0_SE17_PIN 24U          /*!<@brief PORTE pin index: 24 */
#define BOARD_INITPINS_ADC0_SE17_CHANNEL 24       /*!<@brief GPIOE GPIO channel: 24 */
#define BOARD_INITPINS_ADC0_SE17_PIN_NAME PTE24   /*!<@brief Pin name */
#define BOARD_INITPINS_ADC0_SE17_LABEL "row4"     /*!<@brief Label */
#define BOARD_INITPINS_ADC0_SE17_NAME "ADC0_SE17" /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTC0 (coord B12), col1
  @{ */
#define BOARD_INITPINS_ADC0_SE14_PERIPHERAL GPIOC /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ADC0_SE14_SIGNAL GPIO      /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ADC0_SE14_GPIO GPIOC       /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ADC0_SE14_GPIO_PIN 0U      /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_ADC0_SE14_PORT PORTC       /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ADC0_SE14_PIN 0U           /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_ADC0_SE14_CHANNEL 0        /*!<@brief GPIOC GPIO channel: 0 */
#define BOARD_INITPINS_ADC0_SE14_PIN_NAME PTC0    /*!<@brief Pin name */
#define BOARD_INITPINS_ADC0_SE14_LABEL "col1"     /*!<@brief Label */
#define BOARD_INITPINS_ADC0_SE14_NAME "ADC0_SE14" /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTD1 (coord D4), col2
  @{ */
#define BOARD_INITPINS_SPI0_SCK_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_SPI0_SCK_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_SPI0_SCK_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SPI0_SCK_GPIO_PIN 1U      /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_SPI0_SCK_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI0_SCK_PIN 1U           /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_SPI0_SCK_CHANNEL 1        /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_INITPINS_SPI0_SCK_PIN_NAME PTD1    /*!<@brief Pin name */
#define BOARD_INITPINS_SPI0_SCK_LABEL "col2"     /*!<@brief Label */
#define BOARD_INITPINS_SPI0_SCK_NAME "SPI0_SCK"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTD2 (coord C4), col4
  @{ */
#define BOARD_INITPINS_SPI0_SOUT_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_SPI0_SOUT_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_SPI0_SOUT_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SPI0_SOUT_GPIO_PIN 2U      /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_SPI0_SOUT_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI0_SOUT_PIN 2U           /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_SPI0_SOUT_CHANNEL 2        /*!<@brief GPIOD GPIO channel: 2 */
#define BOARD_INITPINS_SPI0_SOUT_PIN_NAME PTD2    /*!<@brief Pin name */
#define BOARD_INITPINS_SPI0_SOUT_LABEL "col4"     /*!<@brief Label */
#define BOARD_INITPINS_SPI0_SOUT_NAME "SPI0_SOUT" /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTD3 (coord B4), col3
  @{ */
#define BOARD_INITPINS_SPI0_SIN_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_SPI0_SIN_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_SPI0_SIN_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SPI0_SIN_GPIO_PIN 3U      /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_SPI0_SIN_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI0_SIN_PIN 3U           /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_SPI0_SIN_CHANNEL 3        /*!<@brief GPIOD GPIO channel: 3 */
#define BOARD_INITPINS_SPI0_SIN_PIN_NAME PTD3    /*!<@brief Pin name */
#define BOARD_INITPINS_SPI0_SIN_LABEL "col3"     /*!<@brief Label */
#define BOARD_INITPINS_SPI0_SIN_NAME "SPI0_SIN"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTD0 (coord A5), col5
  @{ */
#define BOARD_INITPINS_SPI0_PCS0_PERIPHERAL GPIOD /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_SPI0_PCS0_SIGNAL GPIO      /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_SPI0_PCS0_GPIO GPIOD       /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_SPI0_PCS0_GPIO_PIN 0U      /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_SPI0_PCS0_PORT PORTD       /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_SPI0_PCS0_PIN 0U           /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_SPI0_PCS0_CHANNEL 0        /*!<@brief GPIOD GPIO channel: 0 */
#define BOARD_INITPINS_SPI0_PCS0_PIN_NAME PTD0    /*!<@brief Pin name */
#define BOARD_INITPINS_SPI0_PCS0_LABEL "col5"     /*!<@brief Label */
#define BOARD_INITPINS_SPI0_PCS0_NAME "SPI0_PCS0" /*!<@brief Identifier name */
                                                  /* @} */

