G-JE/Tsunami/WaveBee/board/pin_mux.h
/*! @name PORTA25 (coord J12), col8
  @{ */
#define BOARD_INITPINS_CMP3_IN5_PERIPHERAL GPIOA /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_CMP3_IN5_SIGNAL GPIO      /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_CMP3_IN5_GPIO GPIOA       /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_CMP3_IN5_GPIO_PIN 25U     /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_CMP3_IN5_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CMP3_IN5_PIN 25U          /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_CMP3_IN5_CHANNEL 25       /*!<@brief GPIOA GPIO channel: 25 */
#define BOARD_INITPINS_CMP3_IN5_PIN_NAME PTA25   /*!<@brief Pin name */
#define BOARD_INITPINS_CMP3_IN5_LABEL "col8"     /*!<@brief Label */
#define BOARD_INITPINS_CMP3_IN5_NAME "CMP3_IN5"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTC2 (coord A12), col6
  @{ */
#define BOARD_INITPINS_FTM0_CH1_PERIPHERAL GPIOC /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_FTM0_CH1_SIGNAL GPIO      /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_FTM0_CH1_GPIO GPIOC       /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_FTM0_CH1_GPIO_PIN 2U      /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_FTM0_CH1_PORT PORTC       /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_FTM0_CH1_PIN 2U           /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_FTM0_CH1_CHANNEL 2        /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_INITPINS_FTM0_CH1_PIN_NAME PTC2    /*!<@brief Pin name */
#define BOARD_INITPINS_FTM0_CH1_LABEL "col6"     /*!<@brief Label */
#define BOARD_INITPINS_FTM0_CH1_NAME "FTM0_CH1"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTC5 (coord D8), col7
  @{ */
#define BOARD_INITPINS_FB_AD10_PERIPHERAL GPIOC /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_FB_AD10_SIGNAL GPIO      /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_FB_AD10_GPIO GPIOC       /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_FB_AD10_GPIO_PIN 5U      /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_FB_AD10_PORT PORTC       /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_FB_AD10_PIN 5U           /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_FB_AD10_CHANNEL 5        /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_INITPINS_FB_AD10_PIN_NAME PTC5    /*!<@brief Pin name */
#define BOARD_INITPINS_FB_AD10_LABEL "col7"     /*!<@brief Label */
#define BOARD_INITPINS_FB_AD10_NAME "FB_AD10"   /*!<@brief Identifier name */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
